Tekla Open API Reference for Tekla Structures 2025
ProfileConversion.ConvertFromCurrentUnits Method
 Converts a profile string from current units to internal units (set in Units and decimals options).
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ConvertFromCurrentUnits(
	string Profile,
	ref string ConvertedProfile
)
Public Shared Function ConvertFromCurrentUnits (
	Profile As String,
	ByRef ConvertedProfile As String
) As Boolean
Parameters
Profile
Type: System.String
The profile string to convert.
ConvertedProfile
Type: System.String
The converted profile string.
Return Value
Type: Boolean
True if successfully converted the string.
See Also
Reference
ProfileConversion Class
Tekla.Structures.Dialog Namespace